console.log('--------------завдання 1---------------');
// --створити масив та вивести його в консоль:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// ------------------------------------------------------------------------------
// let m1 = [1,2,3,4,5];
// console.log(m1);
// let m2 = ['1','2','3','4','5'];
// console.log(m2);
// let m3 = [1,'1',false,'2',true];
// console.log(m3);
// ------------------------------------------------------------------------------------
console.log('--------------завдання 2---------------');
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. 
// Вивести в консоль
// ------------------------------------------------------------------------------------
// let m1 = [];
// m1[0] = 1;
// m1[1] = 2;
// m1[2] = 3;
// m1[3] = 4;
// m1[4] = 5;
// console.log(m1);
// --------------------------------------------------------------------------------------------
console.log('--------------завдання 3---------------');
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// ------------------------------------------------------------------------------------------
// for (let i = 0; i<10; i++){
//     document.write(`<div> Блок </div>`);
//     document.write(`<hr>`);
// }
// ------------------------------------------------------------------------------------------------
console.log('--------------завдання 4---------------');
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і 
// індексом всередині
// ---------------------------------------------------------------------------------------------------
// for (i = 0; i<10; i++){
//     document.write(`<div> Блок ${i} </div>`);
//     document.write(`<hr>`);
// }
// ------------------------------------------------------------------------------------------------------
console.log('--------------завдання 5---------------');
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// -----------------------------------------------------------------------------------------------------
// let i = 0;
// while(i<20){
//     document.write(`<h1>Hello</h1>`);
//     document.write(`<hr>`);
//     i++
// }
// ---------------------------------------------------------------------------------------------------------
console.log('--------------завдання 6---------------');
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// -----------------------------------------------------------------------------------------------------
// let i = 0;
// while(i<20){
//     document.write(`<h1> Hello ${i} </h1>`);
//     document.write(`<hr>`);
//     i++
// }
// ------------------------------------------------------------------------------------------------
console.log('--------------завдання 7---------------');
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// --------------------------------------------------------------------------------------
// let arr = [1,2,3,4,5,6,7,8,9,0];
// for(let value of arr){
//     console.log(value)
// }
// -----------------------------------------------------------------------------------------------
console.log('--------------завдання 8---------------');
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// -------------------------------------------------------------------------------------------------
// let arr = ['1','2','3','4','5','6','7','8','9','0'];
// for(i = 0; i < arr.length; i++){
//     console.log(arr[i]);
// }
// -----------------------------------------------------------------------------------------------------
console.log('--------------завдання 9---------------');
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// -------------------------------------------------------------------------------------------------
// let arr = [1,'1',true,'hello',23,false,'world',1234,'okten',true];
// let i = 0;
// while(i < arr.length){
//     console.log(arr[i]);
//     i++
// }
// --------------------------------------------------------------------------------------------------------
console.log('--------------завдання 10---------------');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою 
// if та typeof вивести тільки булеві елементи
// ----------------------------------------------------------------------------------------------------
// let m = [1,'1',true,'hello',23,false,'world',1234,'okten',true];
// for(i = 0; i < m.length; i++){
//     if (typeof m[i] === 'boolean' ){
//         console.log(i);
//         console.log(m[i]);
//     } 
// }
// ---------------------------------------------------------------------------------------------
console.log('--------------завдання 11---------------');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою 
// if та typeof вивести тільки числові елементи
// ----------------------------------------------------------------------------------------------
// let m = [1,'1',true,'hello',23,false,'world',1234,'okten',true];
// for(i = 0; i < m.length; i++){
//     if (typeof m[i] === "number"){
//         console.log(`index : ${i}`);
//         console.log(m[i]);
//     }
// }
// -------------------------------------------------------------------------------------------------
console.log('--------------завдання 12---------------');
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою 
// if та typeof вивести тільки рядкові елементи
// --------------------------------------------------------------------------------------------------
// let m = [1,'1',true,'hello',23,false,'world',1234,'okten',true];
// for(i = 0; i < m.length; i++){
//     if (typeof m[i] === "string"){
//         console.log(`index : ${i}`);
//         console.log(m[i]);
//     }
// }
// -----------------------------------------------------------------------------------------------------
console.log('--------------завдання 13---------------');
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до 
// конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let m = [];
// m[0] = 1;
// m[1] = '2';
// m[2] = true;
// m[3] = 'true';
// m[4] = 123;
// m[5] = [2,3,4,5,6];
// m[6] = false;
// m[7] = [[['5']]];
// m[8] = 'hello';
// m[9] = 3.14;
// for(let value of m ){
//     console.log(value)
// }
// -----------------------------------------------------------------------------------------
console.log('--------------завдання 14---------------');
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log 
// та document.write
// -------------------------------------------------------------------------------------------------
// for(i = 0; i < 10; i++){
//     console.log(i);
//     document.write(`${i} <hr>`);
// }
// ---------------------------------------------------------------------------------------------------
console.log('--------------завдання 15---------------');
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через 
// console.log та document.write
// --------------------------------------------------------------------------------------------------
// for(i = 1; i <= 100; i++){
//     console.log(i);
//     document.write(`${i} <hr>`);
// }
// ------------------------------------------------------------------------------------------------------
console.log('--------------завдання 16---------------');
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через 
// console.log та document.write
// -----------------------------------------------------------------------------------------------------
// for(i = 1; i <= 200; i = i + 2){
//     console.log(i);
//     document.write(`${i} <hr>`);
// }
// --------------------------------------------------------------------------------------------------------
console.log('--------------завдання 17---------------');
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// --------------------------------------------------------------------------------------------------
// for(i = 0; i < 100; i++){
//     if((i%2 === 0) && i !=0 ){
//         console.log(i);
//         document.write(`${i} <hr>`);
//     }
// }
// -----------------------------------------------------------------------------------------------------
console.log('--------------завдання 18---------------');
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. 
// через console.log + document.write
// ------------------------------------------------------------------------------------------------------
// for(i = 0; i < 100; i++){
//     if((i%2 != 0) && i !=0 ){
//         console.log(i);
//         document.write(`${i} <hr>`);
//     }
// }
// ------------------------------------------------------------------------------------------------------
console.log('--------------завдання 19---------------');
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 
// 3й - секунди)
// ----------------------------------------------------------------------------------------------------
// let hour = +prompt('enter hour');
// let minute = +prompt('enter minute');
// let second = +prompt('enter second');
let p = [];
p[0] = +prompt('enter hour');
p[1] = +prompt('enter minute');
p[2] = +prompt('enter second');
// if(typeof p[0] === "" || typeof  p[1] === "" || typeof p[2]=== "" ){
//     alert('enter value');
// }else{
    outer:
    for(var h = 0; h < 24; h++){
        for(var m = 0; m < 60; m++){
            for(var s = 0; s < 60; s++){
                console.log(`${h}: ${m}: ${s}`);
                if(h == p[0] && m == p[1] && s == p[2] ){
                    break outer;
                }
            }       
        }
    }
alert(`${h}: ${m}: ${s}`);
// }
